{"title":"Route Editor - Help","introduction":{"entries":[{"type":"info","text":"This is a quick guide to the different parts of the route editor. It contains a list of the different components that are supported in the editor and how they work together."},{"type":"info","text":"The visuals of the route editor have been designed so that they look as similar as possible to what the reader will see when they view the route in the viewer. To make navigation easier panels can also be collapsed to free up some space."}]},"chapters":[{"title":"Panels","entries":[{"type":"info","text":"There are a number of different panels that can be used to build up a run. These mostly behave in the same way, but they provide an easy way for people to identify what to expect at that point in the run."},{"type":"info","text":"All panels have a few different options available to them. You can state what conditions need to be met for the panel to be displayed, you can also choose if the panel is minimised or maximised when the route is first loaded."},{"type":"info","text":"You add a panel by clicking on the \"Add Panel\" button that appears at the end of the current entries in the route. The type of panel is set by clicking on the \"Type\" drop down at the top of the Edit Panel dialog box."},{"type":"info","text":"To edit a panel, you can hold down on the panel you wish to edit and select \"Edit\" from the context menu that appears. The same process is used to change the ordering of the panels in the route."},{"type":"info","text":"These are the different kinds of panel available:"},{"type":"battle","guide":["This is a battle panel. It contains information about how to fight this particular boss.","It shows the name of the boss and (optionally) it's health.","The \"steps\" in the panel are added as a bulleted list.","They can be added and removed via the edit panel."],"enemy":"Battle Panel","health":123456},{"type":"encounter","guide":["An Encounter panel is very similar to a boss battle.","It's steps are still represented as a list of bullet points.","This can be used to represent a series of actions that should be used in random encounters."]},{"type":"trial","entries":[{"type":"info","text":"The Trials panel type is used to guide players through what they need to do in a Cloister of Trials."},{"type":"info","text":"The information they display can be a list of ANY entry type you want. This should allow you to make indepth guides when needed using all the tools available in this editor."}]},{"type":"shop","guide":["This is a list of items that should be bought."],"cost":1234,"buy":["This is a list of items that should be bought."],"sell":["You can also add a list of items that should be sold."]},{"type":"equipment","guide":["This is used to show what equipment should be equipped at this point","This is a bullet point list."]},{"type":"itemsort","guide":["This is a list of actions, that need to be taken to sort the items","Each entry is a key value pair, it should be presented in CSV format","E.g. Al Bhed Potion with Shining Gem, R2 Confirm R2 Confirm"]},{"type":"spheregrid","entries":[{"type":"info","text":"This is used as as way to guide people through what steps they should be using when doing spheregrids."},{"type":"info","text":"These instructions can be made up of a list of ANY entries that the editor supports. This is so you can provide the most detailed information possible."}]},{"type":"customise","guide":["This is a bullet point list of the customisations that should be made to the listed equipment."],"item":"<Item to be customised>"},{"type":"blitzball","entries":[{"type":"info","text":"This is a way to guide people on what they should do in the Blitzball matches they need to play."},{"type":"info","text":"The information in these is displayed as a list of all the components available in the editor. This is so you can provide as much detailed information as possible."}]},{"type":"tip","entries":[{"type":"info","text":"A Tip panel is used for anything that you want to highlight to the player. This could be anything from suggestions on positioning in a Blitzball match to instructions on how to perform a skip."},{"type":"info","text":"This is intended for information that isn't essential to the run, but will help beginners with some of the trickier aspects of the route."},{"type":"info","text":"The information in these panels is displayed as a list of all available component types."}]}],"index":0},{"title":"Entries","entries":[{"type":"info","text":"Entries are the different components that can be added to the guide. They are the building blocks of the run, and there are a few different types that can be chosen from."},{"type":"info","text":"To add an entry to the run click on the \"Add Entry\" button at the bottom of the page."},{"type":"info","text":"Entries can have conditions applied to them. It is possible to only show them in specific circumstances."},{"type":"info","text":"To edit an entry you can long click on the entry you want to update and select \"Edit\" from the context menu that appears. The position of the entries can be updated in the same way."},{"type":"info","text":"The type of entry can be changed by selecting the \"Type\" dropdown menu at the top of the \"Edit Entry\" dialog."},{"type":"info","text":"These are the available entries:"},{"type":"info","text":"Info - This is just simple line of text."},{"type":"info","text":"Image - Embed an image into the run. There is currently an issue where the image needs to be uploaded to SpiraGPS before it can be displayed in a run."},{"type":"bullets","guide":["A simple list of multiple points","You can add as many points in a list as you want","Selecting \"Bold\" will make the title appear bold."],"bold":true,"text":"Bullet Points"},{"type":"info","columns":2,"text":"Table - An easy way to display lots of related information. There is currently a known bug where the list of items needs to be a multiple of 2 otherwise the final row won't be displayed properly. Tables are always 2 columns wide and when you enter the data it should be added column first."},{"type":"table","guide":["Row 1, Column 1","Row 2, Column 1","Row 1, Column 2","Row 2, Column 2"],"columns":2}],"index":1},{"title":"Conditions","entries":[{"type":"info","text":"Conditions are used to show and hide different parts of the guide depending on what options have been selected from the list that is anchored to the top of the screen in the route viewer."},{"type":"info","text":"You can add a condition by clicking on the \"Update Conditions\" button at the bottom of the screen. This will open a dialog where you can set the name of the condition and it's default state. Once a condition has been created each entry and panel can then be linked to it and will display based on the state selected when setting their condition."}],"index":2},{"title":"Keywords","entries":[{"type":"info","text":"Keywords are automagically highlighted by being made bold. You can add as many keywords you want to your guide."},{"type":"info","text":"There are a number of keywords that already exist within the SpiraGPS system. These are words that are common across all routes and often have more formatting associated with them than simply making them appear bold."},{"type":"bullets","guide":["Tidus, Yuna, Auron, Wakka, Kimahri, Lulu, Rikku","Valefor, Ifrit, Ixion, Shiva, Bahamut, Anima","Seymour, Jassu, Keepa, Balgerda, Abus","Enemy, Any and BUG!"],"text":"Pre-existing keywords include"}],"index":3},{"title":"Contents","entries":[{"type":"info","text":"The contents list is generated automagically by the route viewer based on the chapter titles. You shouldn't need to worry about setting these, just make sure your chapter titles make sense for the reader."}],"index":4},{"title":"Saving/Loading","entries":[{"type":"info","text":"Routes can be saved and loaded using the Load and Save buttons at the bottom of the screen."},{"type":"info","bold":true,"text":"ROUTES ARE NOT AUTO SAVED! "},{"type":"info","text":"It is your responsibility to remember to save your work!"}],"index":5},{"title":"Known Issues","entries":[{"type":"bullets","guide":["Editor: BUG! Tables HAVE to have entries totaling a multiple of 2, this shouldn't be the case.","Editor: BUG! Caret is all shy, this can make it difficult to edit text.","Editor: BUG! Adding too many entries in a bulleted list pushes the Save/Cancel buttons off screen.","Editor: Feature. Chapters cannot be re-organised."]}],"index":6}]}